drone-rails-app/app/controllers/status_controller.rb

	def get_current_status
		@latest_status = Status.last
---
SELECT "statuses".* FROM "statuses" ORDER BY "statuses"."id" DESC LIMIT 1

	def show
		@latest_status = Status.last
---
SELECT "statuses".* FROM "statuses" ORDER BY "statuses"."id" DESC LIMIT 1

	def create
		@new_status = Status.new(
			"system_status" => params[:status][:system_status],
			"next_order_id" => params[:status][:next_order_id]
		)
	    if @new_status.save
---
INSERT INTO "statuses" ("created_at", "next_order_id", "system_status", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 23 Feb 2016 14:35:46 UTC +00:00], ["next_order_id", "asdlfjkasldf"], ["system_status", "first asdfjkas"], ["updated_at", Tue, 23 Feb 2016 14:35:46 UTC +00:00]]